In [30]:
import pandas as pd
import numpy as np

In [31]:
dict1 = {
    'emp_id':[1001,1002,1003,1004],
    'name':['anshul','abhay','amit','yash'],
    'age':[18,34,31,25]
}
dict1

{'emp_id': [1001, 1002, 1003, 1004],
 'name': ['anshul', 'abhay', 'amit', 'yash'],
 'age': [18, 34, 31, 25]}

In [33]:
df1 = pd.DataFrame(dict1)
df1

   emp_id    name  age
0    1001  anshul   18
1    1002   abhay   34
2    1003    amit   31
3    1004    yash   25

In [34]:
dict2 = {
    'emp_id':[1001,1002,1005,1006],
    'sal':[20000,30000,40000,50000],
    'address':['panipat','mohali','lucknow','noida']
}
dict2

{'emp_id': [1001, 1002, 1005, 1006],
 'sal': [20000, 30000, 40000, 50000],
 'address': ['panipat', 'mohali', 'lucknow', 'noida']}

In [35]:
df2 = pd.DataFrame(dict2)
df2

   emp_id    sal  address
0    1001  20000  panipat
1    1002  30000   mohali
2    1005  40000  lucknow
3    1006  50000    noida

In [ ]:
# inner merge

In [42]:
pd.merge(df1,df2,how ='inner',on='emp_id')

   emp_id    name  age    sal  address
0    1001  anshul   18  20000  panipat
1    1002   abhay   34  30000   mohali

In [43]:
# outer merge

In [44]:
pd.merge(df1,df2,how='outer',on='emp_id')

   emp_id    name   age      sal  address
0    1001  anshul  18.0  20000.0  panipat
1    1002   abhay  34.0  30000.0   mohali
2    1003    amit  31.0      NaN      NaN
3    1004    yash  25.0      NaN      NaN
4    1005     NaN   NaN  40000.0  lucknow
5    1006     NaN   NaN  50000.0    noida

In [45]:
# left merge

In [50]:
pd.merge(df1,df2,how='left',on= 'emp_id',suffixes = ('_x','_y'))

   emp_id    name  age      sal  address
0    1001  anshul   18  20000.0  panipat
1    1002   abhay   34  30000.0   mohali
2    1003    amit   31      NaN      NaN
3    1004    yash   25      NaN      NaN

In [51]:
# right merge

In [53]:
pd.merge(df1,df2,how = 'right')

   emp_id    name   age    sal  address
0    1001  anshul  18.0  20000  panipat
1    1002   abhay  34.0  30000   mohali
2    1005     NaN   NaN  40000  lucknow
3    1006     NaN   NaN  50000    noida

In [54]:
# cross merge

In [56]:
pd.merge(df1,df2,how='cross')

    emp_id_x    name  age  emp_id_y    sal  address
0       1001  anshul   18      1001  20000  panipat
1       1001  anshul   18      1002  30000   mohali
2       1001  anshul   18      1005  40000  lucknow
3       1001  anshul   18      1006  50000    noida
4       1002   abhay   34      1001  20000  panipat
5       1002   abhay   34      1002  30000   mohali
6       1002   abhay   34      1005  40000  lucknow
7       1002   abhay   34      1006  50000    noida
8       1003    amit   31      1001  20000  panipat
9       1003    amit   31      1002  30000   mohali
10      1003    amit   31      1005  40000  lucknow
11      1003    amit   31      1006  50000    noida
12      1004    yash   25      1001  20000  panipat
13      1004    yash   25      1002  30000   mohali
14      1004    yash   25      1005  40000  lucknow
15      1004    yash   25      1006  50000    noida

In [1]:
import pandas as pd
import datetime as dt

In [3]:
today = dt.date(2024,7,4)
today

datetime.date(2024, 7, 4)

In [4]:
today.day

4

In [5]:
today.month

7

In [6]:
today.year

2024

In [11]:
today = dt.datetime(2024,7,4,10,39,12)
today

datetime.datetime(2024, 7, 4, 10, 39, 12)

In [12]:
pd.Timestamp("2024/07/04 10:41:31")

Timestamp('2024-07-04 10:41:31')

In [14]:
dateindex = pd.DatetimeIndex(['2024/07/04','2024/07/03','2024/07/02','2024/07/01'])
dateindex

DatetimeIndex(['2024-07-04', '2024-07-03', '2024-07-02', '2024-07-01'], dtype='datetime64[ns]', freq=None)

In [15]:
temp = [35,37,38,39]

In [19]:
temp_day = pd.Series(data = temp , index = dateindex)

In [20]:
temp_day

2024-07-04    35
2024-07-03    37
2024-07-02    38
2024-07-01    39
dtype: int64

In [26]:
pd.to_datetime(['july 4 2024','2024/07/04','6th dec 2023','today'],errors = 'ignore')

C:\Users\Shaina Hussain\AppData\Local\Temp\ipykernel_21228\1388553324.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.to_datetime(['july 4 2024','2024/07/04','6th dec 2023','today'],errors = 'ignore')

DatetimeIndex([       '2024-07-04 00:00:00',        '2024-07-04 00:00:00',
                      '2023-12-06 00:00:00', '2024-07-04 11:06:08.777592'],
              dtype='datetime64[ns]', freq=None)

In [37]:
pd.date_range(start = '2024/07/04',end = '2024/12/15' , periods = 12)

DatetimeIndex([          '2024-07-04 00:00:00',
               '2024-07-18 21:49:05.454545454',
               '2024-08-02 19:38:10.909090909',
               '2024-08-17 17:27:16.363636363',
               '2024-09-01 15:16:21.818181818',
               '2024-09-16 13:05:27.272727272',
               '2024-10-01 10:54:32.727272727',
               '2024-10-16 08:43:38.181818182',
               '2024-10-31 06:32:43.636363636',
               '2024-11-15 04:21:49.090909090',
               '2024-11-30 02:10:54.545454544',
                         '2024-12-15 00:00:00'],
              dtype='datetime64[ns]', freq=None)